Учет_документов_20.ДокументыИТорги/src/Documents/ОтправкаПочты/ОтправкаПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтправкаПочты</name>
  <registerRecords>InformationRegister.ДоставкаДокументовКурьером</registerRecords>
  <attributes>
    <name>НеИзрасходованныеСредстваИзПредыдущегоОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоНаПочтовыеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияСредств</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПотраченоНаПочтовыеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьПотратитьНаПочтовыеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмаОтправил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнформацияООтправленныхДокументах</name>
    <attributes>
      <name>ДатаОтправкиПисьма</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолучательДокументов</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписьСодержимогоКонверта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДляОтслеживания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_документов_20.ДокументыИТорги/src/InformationRegisters/ДоставкаДокументовКурьером/ДоставкаДокументовКурьером.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоставкаДокументовКурьером</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолучательДокументов</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_документов_20.ДокументыИТорги/src/Documents/ОтправкаПочты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ОтправкаПочтыИнформацияООтправленныхДокументах.Сумма) КАК Сумма,
		|	ОтправкаПочты.Ссылка
		|ИЗ
		|	Документ.ОтправкаПочты.ИнформацияООтправленныхДокументах КАК ОтправкаПочтыИнформацияООтправленныхДокументах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтправкаПочты КАК ОтправкаПочты
		|		ПО ОтправкаПочтыИнформацияООтправленныхДокументах.Ссылка = ОтправкаПочты.Ссылка
		|ГДЕ
		|	ОтправкаПочты.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ОтправкаПочты.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтотОбъект.ПотраченоНаПочтовыеРасходы = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
	ЭтотОбъект.ОсталосьПотратитьНаПочтовыеРасходы = ЭтотОбъект.НеИзрасходованныеСредстваИзПредыдущегоОтчета + ЭтотОбъект.ПолученоНаПочтовыеРасходы - ЭтотОбъект.ПотраченоНаПочтовыеРасходы;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ДоставкаДокументовКурьером
	Движения.ДоставкаДокументовКурьером.Записывать = Истина;
	Для Каждого ТекСтрокаИнформацияООтправленныхДокументах из ИнформацияООтправленныхДокументах Цикл
		Движение = Движения.ДоставкаДокументовКурьером.Добавить();
		Движение.Период = Дата;
		Движение.АвторДокумента = ПисьмаОтправил;
		Движение.Дата = ТекСтрокаИнформацияООтправленныхДокументах.ДатаОтправкиПисьма;
		Движение.ПолучательДокументов = ТекСтрокаИнформацияООтправленныхДокументах.ПолучательДокументов;
		Движение.Наименование = ТекСтрокаИнформацияООтправленныхДокументах.ОписьСодержимогоКонверта;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
